artillery.yml
config:
  target: "http://0.0.0.0:4001/"
  processor: './makeFakeData.js'
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 720
      arrivalRate: 5
      rampTo: 500
      name: Ramp up load
    - duration: 300
      arrivalRate: 500
      name: Sustained load

scenarios:
  - name: "question SLAM"
    flow:
      - function: 'generateRandomData'
      - post:
          url: '/'
          json:
            query: '{
  Question(product_id: {{ product_Id }}) {
    name
    body
    date
    has_answer{
      name
      date
      body
      helpful
      has_photo{
        url
      }
    }
  }
}'